import React from "react";
import "./Blog.css";
import { useState, useEffect } from "react";
const Blog = () => {
  const initial = [
    {
      src: "./image/1.jpg",
      title: "مروری برفعالیت های مسئولیت اجتماعی اسنپ",
      text: "تیم مسئولیت اجتماعی اسنپ همواره تلاش کرده است طرح‌های متنوعی را در مسیر مسئولیت اجتماعی شرکتی خود اجرا کند. استراتژی مسئولیت اجتماعی این سوپراپلیکیشن در انتخاب و ارائه‌ی طرح‌ها به دو شکل همسو و مرتبط با ماهیت کسب‌وکار (high-fit) و همچنین همسو و هم‌راستا با نیاز جامعه (low-fit) تدوین می‌شود. به‌طور کلی طرح‌های مسئولیت اجتماعی اسنپ شامل موارد زیر می‌شود: - معافیت از پرداخت کمیسیون ویژه‌ی کاربران راننده - ارائه‌ی تخفیف‌های ویژه‌ به مسافران - اجرای طرح‌های نیکوکاری در اسنپ‌کلاب - تخصیص هدایای سازمانی با ایده‌های مسئولیت اجتماعی - همراهی با مردم در بحران‌های فراگیر مانند سیل، زلزله و غیره - دسترس‌پذیری اپلیکیشن برای افراد دارای...",
      index:"مسئولیت اجتماعی"
    },
    {
      src: "./image/2.jpeg",
      title: "تیم امنیت سایبری اسنپ از هکر های کلاه سفید دعوت به همکاری می کند",
      text: "تیم امنیت سایبری اسنپ در تازه‌ترین اقدام خود برای تقویت ساختار امنیت داده‌، برنامه‌ی «باگ بانتی» یا مسابقات ارزیابی امنیتی و شناسایی باگ خود را گسترش داده است. برنامه‌ی باگ بانتی اسنپ، چهارسطح از Medium تا Vital دارد که برای آن پاداش‌های جدیدی تا سقف ۱۵۰ میلیون تومان تعیین شده است. تیم امنیت سایبری اسنپ از سال ۱۳۹۹ برنامه‌ی باگ بانتی را برای ایجاد انگیزه‌ی بیشتر در هکرهای کلاه‌سفید و دعوت آن‌ها به همکاری برای کشف نقاط آسیب‌پذیر آغاز کرد. به‌واسطه‌ی این برنامه، تاکنون، بیش از ۲۰۰ باگ امنیتی توسط ۶۸ شکارچی باگ گزارش شده است که از این میان ۸۶...",
      index:"خیر"
    },
    {
      src: "./image/3.jpg",
      title: "دسترسی های نسخه ی اندروید اسنپ",
      text: " هر اپلیکیشنی که در تلفن‌های هوشمند نصب می‌شود، برای عملکرد صحیح برخی قابلیت‌های خود نیاز به دریافت یکسری دسترسی‌ دارد؛ دسترسی‌های اپلیکیشن اسنپ به طور اختیاری از شما گرفته می‌شود. در ادامه می‌توانید با دسترسی‌های نسخه‌ی اندروید و دلایل مربوط به گرفتن هر کدام از آن‌ها آشنا شوید. Location موقعیت مکانی یکی از دسترسی‌های اختیاری نسخه‌ی اندروید اسنپ است. نرم‌افزار اسنپ، به دلیل ماهیت موقعیت‌محور بودنش، با دسترسی به موقعیت مکانی عملکرد مناسب‌تری خواهد داشت. این دسترسی در سرویس‌های مختلف سوپر اپلیکیشن اسنپ مانند درخواست خودرو، درخواست پیک موتوری، سفارش غذا، خرید سوپر مارکت و درخواست وانت مورد استفاده قرار می‌گیرد. در...",
      index:"آموزشی"
    },
    {
      src: "./image/4.jpg",
      title: "اسنپ در چه شهرهایی فعال است؟",
      text: " بیش از ۹ سال از آغاز فعالیت اسنپ، به عنوان اولین سامانه هوشمند حمل‌ونقل، در ایران می‌گذرد و این تاکسی اینترنتی امروز با خدمات‌رسانی در تمام ۳۱ استان ایران عنوان بزرگترین سرویس آنلاین حمل‌ونقل در کشور را در اختیار دارد. اسنپ به مرور فعالیت خود را در شهرهای مختلف کشور گسترش می‌دهد و در ادامه می‌توانید استان‌ها و شهرهای بزرگ و کوچک تحت پوشش خدمات اسنپ را ببینید. اسنپ اکنون در ۳۲۳ شهر بزرگ و کوچک فعال است. استان‌ها و شهرهای بزرگ و کوچک تحت پوشش اسنپ آذربایجان شرقی (آذرشهر، اسکو، اهر، ایلخچی، باسمنج، بستان آباد، بناب، تبریز، جلفا، خسروشاه، سراب، سردرود،...",
      index:"خیر"
    },
    {
      src: "./image/5.jpg",
      title:
        "تاثیر امتیازدهی مسافران بر افزایش استفاده از کولر در سفرهای اسنپی",
      text: "در سفرهای اسنپی، چطور «امتیازدهی به تهویه‌ خودرو» منجر به استفاده رانندگان بیشتری از کولر می‌شود؟ با شروع فصل گرما، بحث استفاده از کولر به یکی از دغدغه‌های ثابت کاربران تبدیل شده است. حس و حال کاربران در طول سفر برای اسنپ بسیار مهم است؛ از همین رو تلاش می‌کنیم با استفاده از راهکارهایی شرایط را به نحوی مهیا کنیم تا در نهایت کاربران راننده‌ی بیشتری ترغیب به استفاده از کولر شوند. داشتن تهویه مناسب در سفرهای اسنپی الزامی است. به همین منظور، اقداماتی را در دستور کار قرار دادیم تا از کیفیت تهویه هوا در سفرها اطمینان حاصل کنیم. در ادامه...",
      index:"آموزشی"
    },
    {
      src: "./image/6.jpeg",
      title: "اسنپ چگونه امنیت سفر را تامین می کند",
      text: " امنیت سفر اولویت و دغدغه‌ی اصلی ما در اسنپ است. با ثبت اطلاعات کاربران مسافر و راننده و مشخصات سفرها،‌ پشتیبانی ۲۴ ساعته و احراز هویت و تایید صلاحیت کاربران راننده پشتوانه‌ای برای سفرهای امن ساخته‌ایم و همچنان خود را متعهد به یافتن راه‌حل‌های موثرتری برای تامین امنیت هر دو گروه از کاربرانمان می‌دانیم. تمامی رانندگان اسنپ تایید صلاحیت می‌شوند اسنپ با همکاری پلیس ناجا با یک استعلام همه‌جانبه صلاحیت تمام متقاضیان را پیش از پیوستن به ناوگان بررسی می‌کند. از آنجا که تامین امنیت کاربران مسافر در سفر از اولویت‌های مهم ماست، تایید صلاحیت همه‌‌جانبه‌ی رانندگان را به پلیس نظارت بر اماکن...",
      index:"آموزشی"
    },
  ];
  const [animate, setanimate] = useState();

  useEffect(() => {
    setanimate(true);
  }, []);

  return (
    <div style={{backgroundColor:"#f4f4f4"}}>
     
      <div className={animate ? "dangle" : ""}>
        <div className="row">
          {initial.map((item,index) => (
            <div key={index} className="col-sm-4">
                <div className="cardSt">
                    <div className="layout">
                        
                    </div>
                    <img src={require(`${item.src}`)}/>
                    <div className="Text">
                        <h6>{item.title}</h6>
                        {/* <p>{item.text}</p> */}
                    </div>
                </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default Blog;
